	.equ 	XTAL = 1000000 	
	.equ 	baudrate = 9600
;NOTE! .equ 	baudrate = 2400 - на практике  
	.equ 	bauddivider = XTAL/(16*baudrate)-1

;=============================================================================
uart_init:	
		LDI 	R16, low(bauddivider)
		OUT 	UBRRL,R16
		LDI 	R16, high(bauddivider)
		OUT 	UBRRH,R16
 
		LDI 	R16,0
		OUT 	UCSRA, R16
 
; Прерывания запрещены, прием-передача разрешен.
		LDI 	R16, (1<<RXEN)|(1<<TXEN)|(0<<RXCIE)|(0<<TXCIE)|(0<<UDRIE)
		OUT 	UCSRB, R16	
 
; Формат кадра - 8 бит, пишем в регистр UCSRC, за это отвечает бит селектор
		LDI 	R16, (1<<URSEL)|(1<<UCSZ0)|(1<<UCSZ1)
		OUT 	UCSRC, R16
		RET
;=============================================================================

uart_snt:	
		SBIS 	UCSRA,UDRE	; Пропуск если нет флага готовности
		RJMP	uart_snt 	; ждем готовности - флага UDRE
 
		OUT	UDR, R16	; шлем байт
		RET			; Возврат
;=============================================================================
uart_rcv:	
		SBIS	UCSRA,RXC	; Ждем флага прихода байта
		RJMP	uart_rcv	; вращаясь в цикле
 
		IN	R16,UDR		; байт пришел - забираем.
		RET			; Выходим. Результат 
;=============================================================================	
 
 

